"""
关键字前缀，通过这些前缀
获取职位
"""

KW_PREFIX = {
        "java": {"java", "后端", "Android", "java开发", 'ja'},
        "c++": {'c++'},
        "游戏":{'游戏'},
        "php": {'php'},
        "c#": {'c#'},
        "ios": {'ios'},
        "python": {'数据', '大数据', '数据挖掘', '爬虫', 'python后端', 'python', 'python实习生'},
        "人工智能": {"算法", "人工智能", '深度学习', '机器学习'},
        "web": {"web前端", '前端'},
        'ui':{'UI'},
        'ruby': {'ruby'},
        '.net': {'.net'},
        "html5": {'html5'},
        "node.js": {'node.js'},
    }
"""
 从爬到的关键字中应该,
 去除这些职位
"""
KW_OUTER = {
        "客服","经理","测试","策划","主管","老师","公司",
        "学校","校","院"
    }
'''
 热门城市
'''
HOT_CITY = {
        "北京": "010000",
        "上海": "020000",
        "广州": "030200",
        "深圳": "040000",
        "武汉": "180200",
        "西安": "200200",
        "杭州": "080200",
        "南京": "070200",
        "成都": "090200",
        "重庆": "060000",
        "东莞": "030800",
        "大连": "230300",
        "沈阳": "230200",
        "苏州": "070300",
        "昆明": "250200",
        "长沙": "190200",
        "合肥": "150200",
        "宁波": "080300",
        "郑州": "170200",
        "天津": "050000",
        "青岛": "120300",
        "济南": "120200",
        "哈尔滨": "220200",
        "长春": "240200",
        "福州": "110200",
}